Repository: Thierry46/CalcAl
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: fr

source: Error : 0 parameter allowed
fr: Erreur : aucun paramètre autorisé

source: Directory created
fr: Répertoire créé

source: Starting
fr: Démarrage

source: Thanks to you
fr: Merci à vous

source: for using this software
fr: d'utiliser ce logiciel

source: End of
fr: Fin de

source: Messages now logged in
fr: Les messages sont enregistrés dans

source: To contact authors
fr: Pour contacter les auteurs

source: Detected language and encoding on this computer
fr: Langue et encodage détectés sur cet ordinateur

source: Demo DB copied
fr: Base demo copiée

source: Starting GUI
fr: Démarrage de l'IHM

source: On
fr: Sur

source: characters copied and available in clipboard
fr: caractères copiés et disponibles dans le presse-papier

source: Welcome
fr: Bienvenue

source: Calculator
fr: Calculateur

source: Search
fr: Recherche

source: Tab
fr: Onglet

source: selected
fr: activé

source: Based on Nutrial components databases Ciqual 2013 and 2016
fr: Basé sur les composants nutritionnels des bases Ciqual 2013 et 2016

source: Selection
fr: Sélection

source: Modify
fr: Modifier

source: Group
fr: Grouper

source: Ungroup
fr: Dégrouper

source: Delete in database
fr: Supprimer de la base

source: Erase line
fr: Effacer la ligne

source: Plugins
fr: Modules

source: Download Ciqual reader
fr: Téléchargez le lecteur Ciqual

source: Installation canceled
fr: Installation annulée

source: Plugin
fr: Module

source: has already been installed
fr: déjà installé

source: installed
fr: installé

source: Based on Nutrial components database Ciqual 2013
fr: Basé sur les données de la table de composition nutritionnelle des aliments Ciqual 2013

source: Choose a database to use
fr: Choisissez une base de données à utiliser

source: New
fr: Nouvelle

source: Start
fr: Démarrer

source: chosen
fr: choisie

source: New...
fr: Nouveau...

source: Ready
fr: Prêt

source: New menu
fr: Nouveau menu

source: Enter its name :
fr: Entrez un nom :

source: Load...
fr: Charger...

source: loaded
fr: chargé

source: saved
fr: sauvé

source: Start calculator with database
fr: Démarrage du calculateur avec la base

source: About
fr: A propos...

source: Help...
fr: Aide...

source: Debug logging mode : all messages in file and on console.
fr: Logging dans fichier et sur console en mode DEBUG.

source: Logging in file with mode INFO and on console in mode WARNING.
fr: Logging dans fichier en mode INFO et sur console en mode WARNING.

source: This software helps to evaluate food suplies.
fr: Cette application aide à calculer les apports nutritionnels d'une série d'aliments.

source: Please consult its documentation for more information.
fr: Consultez sa documentation pour plus d'information.

source: New database
fr: Nouvelle base de données

source: Error
fr: Erreur

source: Database initialised
fr: Base de données initialisée

source: Database
fr: Base de données

source: Do you realy want to delete this database ?
fr: Voulez-vous vraiment détruire cette base de données ?

source: deleted
fr: détruite

source: Please select a database
fr: Veuillez sélectionner une base de données

source: Initialize a database
fr: Initialisation d'une base de données

source: New database canceled
fr: Nouvelle base de données annulée

source: Can't create database
fr: Impossible de créer la base

source: information displayed
fr: informations affichées

source: about database
fr: à propos de la base

source: Database name
fr: Nom de la base de données

source: Number of foodstuffs
fr: Nombre d'aliments

source: Number of food families
fr: Nombre de familles d'aliments

source: Number of food groups
fr: Nombre de groupes d'aliments

source: Number of food constituants
fr: Nombre de composants

source: At lest 2 database are needed to join them
fr: Il faut au moins 2 bases de données pour une fusion

source: Join
fr: Fusionner

source: Please choose master database for joinning
fr: Veuillez sélectionner la base principale pour la fusion

source: Join a database to
fr: Fusionner une base de données avec

source: Database joined in
fr: Bases de données fusionnées dans

source: Select a database and click startbutton
fr: Selectionner une base de données puis cliquer sur le bouton Démarrer

source: Enter a new database name
fr: Entrer le nom de la nouvelle base de données

source: Invalid database name
fr: Nom de base de données invalide

source: Database type
fr: Type de base de données

source: Database init file
fr: Fichier pour init de la base

source: Please give a name for your new database
fr: Donnez un nom pour votre nouvelle base de données

source: this database already exists
fr: cette base de données existe déjà

source: Please give a filename containing data to import
fr: Donnez un nom de fichier contenant les données à importer

source: Bad input
fr: Valeur incorecte

source: Choose a file
fr: Choisissez un fichier

source: Download init file
fr: Téléchargez un fichier d'initialisation

source: Copy WEB link in clipboard
fr: Copier le lien WEB dans le presse-papier

source: Download a source file
fr: Téléchargez un fichier source

source: Open your web browser and download from
fr: Ouvrez votre navigateur internet et téléchargez le fichier depuis

source: URL is in your clipboard ready to be pasted in address bar
fr: L'adresse est prête à être collée dans la barre d'adresse

source: File to download on your computer
fr: Fichier à télécharger sur votre ordinateur

source: Please choose secondary database
fr: Choisissez une base secondaire

source: Enter a result database name
fr: Entrez le nom de la base de données résultat

source: Add only
fr: Ajout seulement

source: Update and add
fr: Mise à jour et ajout

source: Menu definition
fr: Définition d'un menu

source: Actions on selection
fr: Commandes à appliquer à la sélection

source: Menu name
fr: Nom du menu

source: For who ?
fr: Pour qui ?

source: Interesting components
fr: Composants à suivre

source: Search food
fr: Recherche d'aliment

source: Search by components
fr: Recherche par composants

source: Name
fr: Nom

source: Foodstuff definition
fr: Définition d'un aliment

source: Family
fr: Famille

source: Quantity (g)
fr: Quantité (g)

source: Qty (g)
fr: Qté (g)

source: Too many components selected
fr: Trop de composants selectionnés

source: Please select one and only one line in food table
fr: Veuillez sélectionner une ligne et une seule dans la table des aliments

source: Please select at least one line in food table
fr: Veuillez sélectionner au moins une ligne dans la table des aliments

source: Please select more than one foodstuff in food table
fr: Veuillez sélectionner plus d'une ligne dans la table des aliments

source: Put in the list
fr: Mettre dans la liste

source: Foodstuff
fr: Aliment

source: foodstuff
fr: aliment

source: foodstuffs
fr: aliments

source: added
fr: ajouté

source: Food name must not be empty
fr: Le nom d'aliment ne doit pas être vide

source: Food quantity must be a number
fr: La quantité d'aliment doit être un nombre

source: Qantity must be greater than zero
fr: La quantité doit être plus grande que zéro

source: Deleting selected food in table
fr: Suppression d'aliments dans le tableau

source: Do you really want to delete selection in database ?
fr: Voulez-vous détruire la selection dans la base de données ?

source: List of food
fr: Liste des aliments

source: Energy given by foods
fr: Energie apportée par les aliments

source: Components
fr: Composants

source: By ratio
fr: En pourcentage

source: By energy
fr: En énergie

source: By value
fr: En valeur

source: Water needed
fr: Besoins en eau

source: Water supplied by food
fr: Eau apportée par les aliments

source: selected and copied
fr: selectionné et copié

source: Save group in database
fr: Sauvegarder ce groupe d'élément dans la base de données

source: Enter the family name of new product
fr: Entrez le nom de la famille du nouveau produit

source: New product
fr: Nouveau produit

source: saved in database
fr: sauvegardé dans la base de données

source: copied in modification area
fr: copié dans la zone de modification

source: Composed product
fr: Produit composé

source: ungrouped
fr: dégroupé

source: Clipboard
fr: Presse-papier

source: Group recording canceled
fr: Enregistrement du groupe annulé

source: removed from above table
fr: effacé de la table au dessus

source: about foodstuf
fr: à propos de l'aliment

source: about foodstuff group
fr: à propos du groupe d'aliment

source: Foodstuff group
fr: Groupe d'aliment

source: Source
fr: Référence

source: Input Date
fr: Date d'entrée

source: Number of constituants
fr: Nombre de composants

source: Group details
fr: Composition du groupe

source: Number of items
fr: Nombre d'éléments

source: Deleting selected user element in database
fr: Suppression de l'éléments sélectionné dans la base de données

source: User element is deleted
fr: L'élément est détruit

source: Portions
fr: Rations et ingestas

source: Save portion
fr: Sauver la ration

source: No food to save
fr: Aucun aliment à sauver

source: Save portion in database
fr: Sauver la ration dans la base

source: Portion recording canceled
fr: Enregistrement de la portion annulé

source: Portion saved in database
fr: Ration sauvée dans la base de données

source: Portion duration (days)
fr: Durée portion (jours)

source: Components selected
fr: Composants selectionnés

source: Use Wildcards : * replaces n chars ? replaces 1 only
fr: Utiliser les jokers : * pour n caractère ? pour un seul

source: Use ? for character letters like é, â, ô...
fr: Utiliser ? à la place des caractères accentués : é,â,ô...

source: Click on food name to copy it in definition frame
fr: Cliquer sur un nom d'aliment pour le copier dans le cadre de définition

source: Use Ctrl and Shift keys
fr: Utiliser les touches Ctrl et Maj

source: for multiple selection
fr: pour la sélection multiple

source: Clic on header :
fr: Cliquer sur les entêtes :

source: - of 1st column to select or unselect all
fr: - de la première cololonne pour selectionner ou déselectionner tout

source: - of other column to sort rows
fr: - des autres colonnes pour trier les lignes

source: Filters definition
fr: Définition des filtres

source: Foodstufs matching filters (values for 100g)
fr: Aliments correspondants à la sélection (valeurs pour 100g)

source: Operator
fr: Opérateur

source: Levels
fr: Seuils

source: Search in data
fr: Rechercher

source: Reset filters
fr: Effacement des filtres

source: Please select a component for filter number
fr: Choisissez un composant pour le filtre numéro

source: Level must be a float number for filter number
fr: Le seuil doit être un nombre décimal pour le filtre numéro

source: Level must be greater than zero for filter number
fr: Le seuil doit être supérieur à zéro pour le filtre numéro

source: Send to calculator
fr: Placer dans le calculateur

source: Please select at least one operator in a filter line
fr: Sélectionnez au moins un opérator sur une ligne de filtre

source: Too many results
fr: Trop de résultats

source: on
fr: sur

source: displayed
fr: affichés

source: Please improve filters
fr: Veuillez améliorer les filtres

source: results matching filters
fr: résultats pour ces filtres

source: Copy
fr: Copier

source: Searching in database
fr: Recherche dans la base de données

source: Set logical expressions on filters lines
fr: Remplissez les expressions sur les lignes de filtres

source: Filter line are combined with logical AND
fr: Les lignes de filtres sont combinées par un ET logique

source: To deselect a filter line, set its operator to empty value
fr: Pour déselectionner une ligne de filtre, effacez son opérateur

source: Click on first column header to select all
fr: Cliquez sur l'entête de la 1ère colone pour tout sélectionner

source: Click on a component column header to sort by this component values
fr: Cliquez sur une entête de colonne composant pour la trier par valeurs

source: Double-click on a result line to put it in calculator
fr: Double-cliquez sur un résultat pour le mettre dans le calculateur

source: Ctrl-C to put in clipboard
fr: Ctrl-C pour mettre dans le presse-papier

source: Double-clic to modify
fr: Double-cliquez pour modifier

source: Please select at least one line in table
fr: Veuillez choisir au moins une ligne dans la liste des aliments

source: The database
fr: La base de données

source: can't be deleted
fr: ne peux pas être détruite

source: doesn't exist
fr: n'existe pas

source: Problem with this new composition product (name already exist)
fr: Problème avec ce nouveau pdoduit de composition (son nom existe déjà)

source: Invalid food name : use more than one letter
fr: Nom d'aliment invalide : utilisez plus d'une lettre

source: Invalid family name : use more than one letter
fr: Nom de famille invalide : utilisez plus d'une lettre

source: Can't ungroup
fr: Impossible de dégrouper

source: not a group
fr: ce n'est pas un groupe

source: Can't delete
fr: Impossible de détruire

source: Not created by user
fr: Non créé par un utilisateur

source: used by
fr: utilisé par

source: Invalid pathology name : use more than one letter
fr: Nom de pathologie invalide : utilisez plus d'une lettre

source: No component given for that pathology
fr: Aucun composant fourni pour cette pathologie

source: No pathology selected
fr: Aucune pathologie choisie

source: Unknown pathologies selected
fr: Pathologies choisies inconnues

source: Portion code not found in database
fr: Code portion introuvable dans la base

source: Dates are invalid in following portions
fr: Les dates sont incorrectes dans les portions suivantes

source: dates corrected in portions table
fr: dates corrigées dans la table des portions

source: Conflict for products with same name and diferent codes
fr: Conflit pour des produits avec le même nom et des codes différents

source: ignore products from second database
fr: produits de la deuxième base ignorés

source: Energies recalculated by CalcAl
fr: Energies recalculées par CalcAl

source: Reader for base
fr: Le lecteur pour la base

source: not found
fr: n'a pas été trouvé

source: can not be loaded
fr: ne peut pas être installé

source: Please contact support team
fr: Veuillez contacter le support technique

source: or
fr: ou

source: Ciqual version not supported
fr: Version Ciqual non autorisée

source: Only .zip or .csv files allowed
fr: Seul les fichiers .zip ou .csv sont acceptés

source: Ciqual file : invalid header field
fr: Fichier Ciqual : champ d'entête invalide

source: instead of
fr: au lieu de

source: Only .zip files allowed
fr: Seul les fichiers .zip sont acceptés

source: Cancel
fr: Annuler

source: Please give a family
fr: Veuillez entrer une famille

source: Please give a food name
fr: Veuillez entrer un nom d'aliment

source: Please give a food name that doesn't exist in database
fr: Veuillez entrer un nom d'aliment qui n'existe pas dans la base

source: Filters
fr: Filtres

source: Portion name
fr: Nom de la ration

source: Today
fr: Aujourd'hui

source: Patient code
fr: Code patient

source: Portion type
fr: Type de portion

source: Period Of day
fr: Moment de la journée

source: Erase filters
fr: Effacer les filtres

source: Filtered existing portions
fr: Portion existantes filtrées

source: Morning
fr: Matin

source: Noon
fr: Midi

source: Evening
fr: Soir

source: Day
fr: Jour

source: Other
fr: Autre

source: Please give a portion name
fr: Veuillez renseigner le nom de la portion

source: Please give a date
fr: Veuillez renseigner la date

source: Please give a patient code
fr: Veuillez renseigner le code patient

source: Please give a portion type
fr: Veuillez renseigner le type de portion

source: Please give a period
fr: Veuillez renseigner le moment de la journée

source: Add or modify Portion in database
fr: Ajouter ou modifier une portion dans la base

source: Do you really want to modify this existing portion in database ?
fr: Voulez-vous vraiment modifier cette portion dans la base ?

source: Please modify portion identificators
fr: Veuillez modifier les identifiants de la portion

source: Loading values
fr: Chargement des valeurs

source: Please correct the date displayed
fr: Veuillez corriger la date affichée

source: Allowed formats for dates
fr: Formats autorisés pour les dates

source: DD/MM/YYYY
fr: JJ/MM/AAAA

source: DD/MM/YY
fr: JJ/MM/AA

source: YYYY/MM/DD
fr: AAAA/MM/JJ

source: Portions matching filters
fr: Rations ou ingestas correspondants aux filtres

source: Selected portion added in calculator
fr: La ration selectionnée a été ajoutée dans le calculateur

source: All
fr: Toutes

source: Delete Portion
fr: Supprimer portion

source: Please select one and only one line in portion table
fr: Veuillez selectionner une ligne et une seule dans la table des portions

source: Destruction canceled
fr: Suppression annulée

source: Portion code
fr: Code ration

source: per day
fr: par jour

source: Defined pathologies
fr: Pathologies définies

source: Delete
fr: Supprimer

source: Pathology name
fr: Nom de la pathologie

source: Reference
fr: Référence

source: Save pathology
fr: Sauver la pathologie

source: Select composants in calculator
fr: Activer les composants dans le calculateur

source: Clear pathology
fr: Effacer la pathologie

source: Pathology saved in database
fr: Pathologie sauvée dans la base

source: Pathology deleted in database
fr: Pathologie détruite dans la base

source: Please select one and only one pathology to delete
fr: Selectionnez une et une seule pathologie à détruire

source: Please select at least one pathology
fr: Selectionnez au moins une pathologie

source: Pathology definition
fr: Définition d'une pathologie

source: Componants to folllow for this pathology
fr: Composants à suivre pour cette pathologie

source: No separator in the date
fr: Pas de séparateur dans la date

source: Too many different separators in the date
fr: trop de séparateurs différents dans la date

source: Date is not valid
fr: la date n'est pas valide

source: Patient selection
fr: Sélection du patient

source: New Patient
fr: Nouveau patient

source: Birth year
fr: Année de naissance

source: Gender
fr: Sexe

source: Size
fr: Taille

source: Graph
fr: tracer

source: Patient monitoring
fr: Suivi du patient

source: U
fr: I

source: Appointment date
fr: Date du suivi

source: Weight (kg)
fr: Poids (kg)

source: Hip size
fr: Tour de hanche

source: Physical activity
fr: Activité physique

source: New monitoring...
fr: Nouveau suivi...

source: Notes for this patient
fr: Notes pour ce patient

source: Show rations
fr: Afficher les rations

source: Show pathologies
fr: Afficher les pathologies

source: Patient information
fr: Données concernant le patient

source: Patient pathologies
fr: Pathologies de ce patient

source: Monitored parameters
fr: Paramètres suivis

source: Modify a monitoring...
fr: Modifier un suivi...

source: Patient displayed
fr: Patient affiché

source: Patient code must be 3 capital letters followed by 3 digits
fr: Le code patient doit être 3 majuscules suivies de 3 chiffres

source: Patient info updated in database
fr: Information patient mises à jour dans la base

source: Patient age must be in
fr: L'age du patient doit être compris dans

source: Patient gender must be M F or U
fr: Le sexe du patient doit être M, F ou I

source: Patient size must be in
fr: La taille du patient doit être comprise entre

source: Patient created in database
fr: Le patient a été créé dans la base

source: Patient deleted in database
fr: Le patient a été supprimé de la base

source: Type new patient code or select an existant
fr: Tapez un nouveau code patient ou sélectionnez un existant
